[
  {
    "id": "1",
    "project_name": "Xendpal",
    "project_tag": "Dropbox clone, online file sharing platform",
    "objective": "Inspired by a friend's suggestion to create a simplified yet powerful alternative to existing file-sharing platforms like Dropbox, XendPal was born. The core objective is to provide a seamless and secure platform where users can effortlessly upload, store, and share files or folders. With just an email address, users can share their digital assets with anyone, anywhere, at any time, redefining the boundaries of digital collaboration and storage.",
    "date": "Jul 2023 - Aug 2023",
    "description": "<p><strong>XendPal: The Next-Gen File Sharing & Storage Solution</strong></p><p><strong>Overview</strong></p><p>XendPal is a cutting-edge file sharing and storage platform designed to simplify and secure the way you manage and share digital assets. Whether it's a critical business document or a cherished family photo, XendPal ensures that your files are always just a click away.</p><p><strong>Core Technologies</strong></p><ul><li><strong>Frontend:</strong> Crafted using React.js and Redux for state management, the UI is both dynamic and user-friendly. The styling is enhanced by Daisy UI and Tailwind CSS, offering a sleek and intuitive user experience.</li><li><strong>Backend:</strong> Powered by FastAPI, a modern Python web framework that offers high performance and robustness, XendPal is built to scale.</li><li><strong>Containerization:</strong> Docker ensures that the application runs consistently across various computing environments.</li><li><strong>Web Server:</strong> Nginx serves as the high-performance, reliable, and secure web server, capable of handling large volumes of traffic.</li><li><strong>Database:</strong> PostgreSQL offers a robust, ACID-compliant storage solution, ensuring data integrity and reliability.</li><li><strong>Database Migration:</strong> Alembic handles database schema changes smoothly, making it easier to manage versions of the database.</li><li><strong>Object-Relational Mapping (ORM):</strong> SQLAlchemy provides a powerful and flexible toolkit for working with relational databases, making data manipulation more Pythonic.</li></ul><p><strong>Key Features</strong></p><ul><li>Secure User Authentication: Ensures that only authorized users can access their files.</li><li>Drag-and-Drop Uploads: Makes adding new files or folders a breeze.</li><li>Email-Based File Sharing: Allows users to share files securely via email links.</li><li>End-to-End Encryption: Guarantees that your files are secure during transit and at rest.</li><li>Access Logs: Provides a detailed history of file access and sharing activities.</li><li>Mobile Responsiveness: Ensures a seamless experience across various devices.</li></ul><p><strong>Why Choose XendPal?</strong></p><ul><li>User-Centric Design: Every feature is designed with the user's convenience in mind.</li><li>Unmatched Security: State-of-the-art encryption algorithms protect your data.</li><li>Highly Scalable: Built to grow with your needs, without compromising performance.</li></ul>",
    "tools_and_technology": "<p><strong>FastAPI:</strong> Chosen for its high performance and easy-to-use features, FastAPI serves as the backbone of our backend operations, enabling rapid development and robust API endpoints.</p><p><strong>React:</strong> Powers the frontend, offering a dynamic and interactive user interface. Its component-based architecture makes it highly reusable and maintainable.</p><p><strong>Redux:</strong> Integrated with React to manage the application's state more efficiently, ensuring a smoother user experience.</p><p><strong>Docker:</strong> Utilized for containerization, Docker ensures that the application runs the same way everywhere, simplifying deployment and scaling.</p><p><strong>Nginx:</strong> Acts as the web server, chosen for its high performance, stability, and rich feature set, including load balancing and reverse proxy capabilities.</p><p><strong>Daisy UI:</strong> Complements Tailwind CSS by providing pre-styled UI components, accelerating the development process and ensuring a consistent design language.</p><p><strong>Tailwind CSS:</strong> Provides utility-first CSS classes that make it incredibly easy to create responsive and maintainable designs.</p><p><strong>Python:</strong> The programming language that ties everything together, known for its readability and versatility, making it ideal for both frontend and backend development.</p>",
    "repo_link": "https://github.com/joeygoesgrey/Xendpal-frontend.git",
    "extra": "XendPal: The Next-Gen File Sharing & Storage Solution ",
    "url": "https://xendpal.vercel.app/",
    "image_file": [
      "xendpal.png",
      "xendpal_1.png",
      "xendpal_2.png",
      "xendpal_3.png"
    ],
    "video_file": []
  },
  {
    "id": "2",
    "project_name": "TechScrape",
    "project_tag": "Tech News Aggregation Platform",
    "objective": "TechScrape is more than just a tech news aggregation platform. It's designed to bring you the latest updates from various tech platforms like TechCrunch, complete with search suggestions and personalized feeds based on your activity or interest!",
    "date": "In Progress",
    "description": "<p><strong>TechScrape: A Sneak Peek into My Upcoming Tech News Platform 📰</strong></p> <p><strong>What is Techscrape?</strong></p><p>Techscrape is more than just a tech news aggregation platform. It's designed to bring you the latest updates from various tech platforms like TechCrunch, complete with search suggestions and personalized feeds based on your activity or interest!</p><p><strong>Tech Stack:</strong></p><p>Backend: FastAPI for optimized performance</p><p>Frontend: Vue.js for a sleek user experience</p><p>Web Scraping: Docker, Selenium, Scrapy, and Playwright to scrape the latest news</p><p>Interactive Features: Nested comment system for multi-layered discussions</p><p><strong>Unique Features (In Progress):</strong></p><p>AI-Generated Summaries: This feature is in the works! Due to API limitations, it's not fully operational yet. Stay tuned for updates.</p><p>Interactive Comment Section: Engage in meaningful conversations about the latest tech trends.</p><p>Search Suggestions and Personalized Feeds: Find content that matters to you easily and enjoy a tailored news experience.</p><p><strong>Challenges & Triumphs:</strong></p><p>Navigating the complexities of a nested comment system and personalized feeds has been a journey of ups and downs. I'm thrilled to say these features are nearing completion!</p><p><strong>What's Next?</strong></p><p>I'm in the final stages of polishing Techscrape and can't wait to share the finished product with you all. Stay tuned for the official launch!</p><p><strong>How You Can Help:</strong></p><p>I'm committed to making Techscrape as resourceful as possible. If you or anyone in your network could assist with OpenAI API tokens or alternative solutions for AI-generated summaries, I'd be incredibly grateful.</p>",
    "tools_and_technology": "<p><strong>FastAPI:</strong> Chosen for its high performance and easy-to-use features, FastAPI serves as the backbone of our backend operations, enabling rapid development and robust API endpoints.</p><p><strong>Vue.js:</strong> Powers the frontend, offering a dynamic and interactive user interface. Its component-based architecture makes it highly reusable and maintainable.</p><p><strong>Docker:</strong> Utilized for containerization, Docker ensures that the application runs the same way everywhere, simplifying deployment and scaling.</p><p><strong>Selenium, Scrapy, Playwright:</strong> Used for web scraping to gather the latest news and information.</p><p><strong>Nested Comment System:</strong> Provides multi-layered discussions and interaction with the content.</p>",
    "repo_link": "https://github.com/joeygoesgrey/Techscrape-frontend",
    "extra": "TechScrape is a promising tech news platform that aims to deliver the latest tech updates with a focus on user experience and interaction. It is currently in development, with unique features such as AI-generated summaries and interactive comment sections",
    "url": "https://techscrapenews.vercel.app/",
    "image_file": [
      "techscrape.png",
      "techscrape_1.png",
    ],
    "video_file": []
  }
]
